{
  "backend/main.mo": "Motoko backend defining publication state, access-controlled publish/unpublish actions, and many data types for users, lessons, assignments, progress, and report cards.",
  "feature_evidence.json": "Feature evidence list linking premium pricing and checkout metadata updates to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing app structure, components, tabs, styling, and premium pricing updates.",
  "frontend/index.css": "Tailwind base/theme configuration defining color tokens, dark mode variables, and global element styling.",
  "frontend/index.html": "Base HTML document setting up PWA metadata, icons, manifest, and mounting point for the React app.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, start behavior, theme colors, and categories.",
  "frontend/public/service-worker.js": "Service worker implementing caching for static assets, dynamic caching for API responses, offline fallback, and cache cleanup.",
  "frontend/src/App.tsx": "Main React app configuring routing, theme, React Query, authentication flow, publication gating, and conditional rendering for landing, setup, and dashboard.",
  "frontend/src/components/AdminPublicationControls.tsx": "Admin UI for publishing or unpublishing the app, including reason input and status display.",
  "frontend/src/components/AssignmentsTab.tsx": "Displays student assignments and provides teachers with tools to assign, view, submit, and grade assignments.",
  "frontend/src/components/Footer.tsx": "Simple footer showing copyright and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Header with branding, theme toggle, authentication controls, and an offline indicator.",
  "frontend/src/components/InstallPrompt.tsx": "PWA install prompt handling for web and iOS users with deferred install logic and dismissal tracking.",
  "frontend/src/components/LessonPlansTab.tsx": "Lists lesson plans with grade filtering and allows teachers to create new lessons.",
  "frontend/src/components/OfflineIndicator.tsx": "Shows online/offline status notifications using PWA connectivity state.",
  "frontend/src/components/OnboardingGuide.tsx": "Displays a multi-step onboarding dialog with role-specific content and tracks completion in localStorage.",
  "frontend/src/components/PremiumBanner.tsx": "Shows a premium upsell alert if the user lacks premium access and triggers an upgrade flow.",
  "frontend/src/components/ProfileSetup.tsx": "Provides a profile creation form that sets name and role, optionally locking role based on sign-in type.",
  "frontend/src/components/ProgressTab.tsx": "Shows assignment completion stats and grade averages for the logged-in student using data from queries.",
  "frontend/src/components/ReportCardsTab.tsx": "Manages premium report card access, checkout, subscription cancellation, and report card generation.",
  "frontend/src/components/RoleSignInButtons.tsx": "Renders sign-in buttons for educator/parent or student, storing the selected role before triggering login.",
  "frontend/src/components/StripeSetup.tsx": "Dialog form for entering Stripe secret key and allowed countries, submitting via useSetStripeConfiguration.",
  "frontend/src/constants/branding.ts": "Defines app name, short name, and tagline constants.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor using the user's Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handling login, stored identity loading, status tracking, and AuthClient setup.",
  "frontend/src/hooks/usePWA.ts": "Detects PWA installation state, online status, and service‑worker update availability.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data like profiles, roles, subjects, and publication state.",
  "frontend/src/index.css": "Tailwind base styles and CSS variables for light/dark themes with utility classes for scroll behavior.",
  "frontend/src/main.tsx": "Bootstraps React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AppStorePreview.tsx": "Placeholder page with no content.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard page showing tabs for lessons, assignments, progress, and report cards with onboarding and premium banner.",
  "frontend/src/pages/LandingPage.tsx": "Landing page that loads a preview from the backend, displays hero and feature sections, and shows role-based sign‑in buttons or a dashboard button if authenticated.",
  "frontend/src/pages/PaymentCancel.tsx": "Displays a cancellation message for failed payments and provides navigation back to the dashboard.",
  "frontend/src/pages/PaymentSuccess.tsx": "Shows a successful payment confirmation, invalidates premium access cache, and links back to the dashboard.",
  "frontend/src/pages/Takedown.tsx": "Renders a maintenance-mode takedown screen with optional reason and admin publication controls.",
  "frontend/src/utils/signInType.ts": "Utility for storing, retrieving, and clearing the pre-login sign‑in type in sessionStorage.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, animations, container settings, and enabling plugins.",
  "project_state.json": "Project metadata describing features, maintenance mode behavior, branding updates, and architectural notes."
}