{
  "backend/main.mo": "Motoko backend actor defining roles, publication status controls, and types for lessons, assignments, progress, and report cards with admin-gated publish/unpublish logic.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of major frontend components, hooks, pages, and styles.",
  "frontend/index.css": "Tailwind base layer defining OKLCH theme variables and dark mode overrides along with global background/foreground styling.",
  "frontend/index.html": "HTML entry point configuring PWA metadata, Apple touch settings, manifest link, and loading the main React script.",
  "frontend/public/manifest.json": "PWA manifest declaring app metadata, icons, theme colors, categories, and launch configuration.",
  "frontend/public/service-worker.js": "Service worker implementing static and dynamic caching, network-first handling for backend calls, offline fallback, and cache cleanup.",
  "frontend/src/App.tsx": "Main React app wiring up routing, authentication, publication gating, profile setup flow, and rendering dashboard or landing content based on state.",
  "frontend/src/components/AdminPublicationControls.tsx": "Admin UI for publishing or unpublishing the app, including reason input and status display.",
  "frontend/src/components/AssignmentsTab.tsx": "Displays student assignments and provides teachers tools to assign lessons and manage submissions.",
  "frontend/src/components/Footer.tsx": "Simple footer showing copyright and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top navigation bar with theme toggle, auth controls, branding, and an offline indicator.",
  "frontend/src/components/InstallPrompt.tsx": "Handles PWA install prompts for web and iOS, showing a dismissible install card.",
  "frontend/src/components/LessonPlansTab.tsx": "Lists and filters lesson plans and allows teachers to create custom or AI-assisted lessons.",
  "frontend/src/components/OfflineIndicator.tsx": "Shows alerts when the app goes offline or comes back online using PWA connectivity status.",
  "frontend/src/components/OnboardingGuide.tsx": "Interactive onboarding modal guiding teachers or students through features, with step navigation and localStorage tracking of completion.",
  "frontend/src/components/PremiumBanner.tsx": "Displays a premium upsell alert if the user lacks premium access, offering an upgrade button.",
  "frontend/src/components/ProfileSetup.tsx": "Profile creation form allowing users to set name and role, with role pre-filled based on sign‑in type.",
  "frontend/src/components/ProgressTab.tsx": "Shows assignment completion stats, averages, and subject data for a student, pulling progress via queries.",
  "frontend/src/components/ReportCardsTab.tsx": "Manages premium report card generation, subscription status, checkout flow, and displays existing report cards.",
  "frontend/src/components/RoleSignInButtons.tsx": "Provides role‑specific sign‑in buttons or dropdown, storing chosen role before triggering Internet Identity login.",
  "frontend/src/components/StripeSetup.tsx": "Modal form that lets admins enter a Stripe secret key and allowed countries, then saves the configuration via a mutation.",
  "frontend/src/constants/branding.ts": "Defines the app name, short name, and tagline for branding.",
  "frontend/src/constants/premiumPricing.ts": "Centralizes premium report card pricing constants and provides a helper to build checkout items.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated/anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, loading stored identities, login/logout, and status tracking.",
  "frontend/src/hooks/usePWA.ts": "Tracks PWA installation status, network status, and service worker update availability.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data such as profiles, subjects, admin actions, and Stripe config.",
  "frontend/src/index.css": "Tailwind base styles with custom CSS variables for theming and layout utilities.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AppStorePreview.tsx": "Empty placeholder page for App Store preview.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard page showing user greeting, onboarding, premium banner, and tabbed views for lessons, assignments, progress, and reports.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page with hero section, feature highlights, and sign‑in or dashboard redirect based on authentication.",
  "frontend/src/pages/PaymentCancel.tsx": "Displays a cancellation message after a failed or cancelled payment and provides a button back to the dashboard.",
  "frontend/src/pages/PaymentSuccess.tsx": "Shows a success message after payment, refreshes premium access queries, and links back to the dashboard.",
  "frontend/src/pages/Takedown.tsx": "Maintenance/takedown notice page with optional reason details and admin publication controls.",
  "frontend/src/utils/lessonUpload.ts": "Utility functions for validating text file uploads, deriving titles, reading files, and generating unsupported file errors.",
  "frontend/src/utils/signInType.ts": "Manages storing, retrieving, and clearing pre‑login sign‑in type in sessionStorage.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading, persisting, and clearing URL parameters, supporting both query and hash routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, themes, and enabling plugins.",
  "project_state.json": "Describes the current project state for an app with role-specific sign‑in, first‑time profile setup logic, and a backend-controlled published/unpublished mode. Includes architectural notes, existing feature definitions, and versioning metadata."
}