{
  "backend/main.mo": "Defines publication controls, access checks, user profile types, and lesson/assignment domain models with admin-gated publish/unpublish methods.",
  "feature_evidence.json": "Reports evidence for a feature that publishes the app using admin-only backend methods and lists related files, components, and tests.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of all main frontend files describing their behavior, props, and logic.",
  "frontend/index.css": "Tailwind base layer defining OKLCH color tokens, light/dark theme variables, and global styling.",
  "frontend/index.html": "PWA-enabled HTML shell providing meta tags, manifest links, and the root mount point.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, icons, display mode, and startup configuration.",
  "frontend/public/service-worker.js": "Service worker implementing versioned caching, network-first navigation, and offline fallbacks.",
  "frontend/src/App.tsx": "Main React app wiring router, queries, and publication gating with identity/profile loading logic and global UI components.",
  "frontend/src/components/ActorNotReadyState.tsx": "Displays a network-initialization state with retry support when the backend actor is not ready.",
  "frontend/src/components/AdminPublicationControls.tsx": "Admin-only UI for publishing or unpublishing the app with reason input and status display.",
  "frontend/src/components/AssignmentsTab.tsx": "Displays student assignments and provides dialogs for submitting, grading, and assigning lessons.",
  "frontend/src/components/Footer.tsx": "Simple footer showing copyright and a link to caffeine.ai.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "Catches unhandled errors and shows a recovery UI with reload and data-clear options.",
  "frontend/src/components/Header.tsx": "Top navigation bar with app branding, theme toggle, authentication controls, and offline indicator.",
  "frontend/src/components/InstallPrompt.tsx": "Handles PWA install prompts for web and iOS, showing a dismissible install card.",
  "frontend/src/components/LessonPlansTab.tsx": "Manages viewing and creating lesson plans, including custom, library-based, uploaded, and AI-generated lessons.",
  "frontend/src/components/OfflineIndicator.tsx": "Shows temporary online/offline alerts based on PWA connectivity status.",
  "frontend/src/components/OnboardingGuide.tsx": "A multi-step onboarding dialog explaining features, subjects, and premium pricing, with localStorage tracking for completion.",
  "frontend/src/components/PremiumBanner.tsx": "Displays a premium upsell alert when the user lacks premium access and provides an upgrade button.",
  "frontend/src/components/ProfileSetup.tsx": "Profile setup form allowing users to set name and role, with role auto-selected based on sign-in type and saved via a mutation.",
  "frontend/src/components/ProgressTab.tsx": "Shows assignment completion, average grades, and subject progress for a student using fetched assignment data.",
  "frontend/src/components/QueryErrorState.tsx": "Reusable error UI component showing an alert with a retry option.",
  "frontend/src/components/ReportCardsTab.tsx": "Manages viewing, generating, and purchasing access to report cards, including upgrade and cancellation flows.",
  "frontend/src/components/RoleSignInButtons.tsx": "Sign-in buttons allowing users to select educator/parent or student roles, storing the choice and handling login flows.",
  "frontend/src/components/ServiceWorkerUpdatePrompt.tsx": "No summary available.",
  "frontend/src/components/StripeSetup.tsx": "No summary available.",
  "frontend/src/constants/branding.ts": "No summary available.",
  "frontend/src/constants/premiumPricing.ts": "No summary available.",
  "frontend/src/hooks/useActor.ts": "No summary available.",
  "frontend/src/hooks/useInternetIdentity.ts": "No summary available.",
  "frontend/src/hooks/usePWA.ts": "No summary available.",
  "frontend/src/hooks/useQueries.ts": "No summary available.",
  "frontend/src/index.css": "No summary available.",
  "frontend/src/main.tsx": "No summary available.",
  "frontend/src/pages/AppStorePreview.tsx": "No summary available.",
  "frontend/src/pages/Dashboard.tsx": "Main dashboard showing lesson plans, assignments, progress, and reports with onboarding and premium prompts.",
  "frontend/src/pages/LandingPage.tsx": "Public landing page that loads preview content, handles auth redirect, and displays feature highlights.",
  "frontend/src/pages/PaymentCancel.tsx": "Displays cancellation notice when a payment fails and offers navigation back to the dashboard.",
  "frontend/src/pages/PaymentSuccess.tsx": "Shows successful payment confirmation, refreshes premium status, and links back to the dashboard.",
  "frontend/src/pages/Takedown.tsx": "Maintenance page explaining temporary unavailability with optional reason and admin controls.",
  "frontend/src/utils/authorizationErrors.ts": "Classifies backend authorization errors and returns standardized user-friendly messages.",
  "frontend/src/utils/clearAppData.ts": "Clears specific app-related local and session storage keys to reset corrupted client state.",
  "frontend/src/utils/lessonUpload.ts": "Helpers for validating lesson file types, deriving titles, reading text files, and handling errors.",
  "frontend/src/utils/signInType.ts": "Stores and retrieves pre-login sign-in type using sessionStorage with legacy key support.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters across query and hash routing.",
  "frontend/src/utils/userFacingErrors.ts": "Maps technical error messages to friendly text, providing specific handling for actor readiness, auth, network, trap, and authorization issues.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines project state metadata, including versioning, architectural notes, known issues, and existing feature requirements for the app."
}