{
  "backend/main.mo": "Motoko actor defining roles, lessons, assignments, publication status management, and data structures for onboarding and education workflows.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected files, components, and test coverage with confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose and behavior of various frontend React components and hooks.",
  "frontend/index.css": "Tailwind-based global stylesheet defining OKLCH color variables, dark mode values, and base app styling.",
  "frontend/index.html": "Base HTML entrypoint setting metadata, PWA manifest links, Apple PWA configuration, and loading the React bundle.",
  "frontend/public/manifest.json": "PWA manifest defining app name, icons, theme colors, categories, and startup behavior.",
  "frontend/public/service-worker.js": "Versioned PWA service worker implementing static caching, aggressive cache cleanup, and network-first navigation handling.",
  "frontend/src/App.tsx": "Sets up the main React app with routing, layout, global providers, and logic for identity, publication status, and error states. Defines the root routes and the IndexPage logic for loading, errors, and conditional rendering.",
  "frontend/src/components/ActorNotReadyState.tsx": "Displays a loading alert indicating backend initialization and includes an optional retry button.",
  "frontend/src/components/AdminPublicationControls.tsx": "Provides admin-only controls to publish or unpublish the app, including reason input and loading states. Uses queries and mutations to manage publication status.",
  "frontend/src/components/AssignmentsTab.tsx": "Manages student assignments, submissions, grading, and lesson assignment creation via various query hooks. Includes multiple dialogs and form state for handling these actions.",
  "frontend/src/components/Footer.tsx": "Renders a simple footer with copyright text and a link to caffeine.ai.",
  "frontend/src/components/GlobalErrorBoundary.tsx": "Implements a global React error boundary that shows an error UI with reload and data‑clear options. Logs errors and optionally displays technical details.",
  "frontend/src/components/Header.tsx": "Renders the app header with branding, theme toggle, auth controls, and offline indicator. Handles logout and theme switching.",
  "frontend/src/components/InstallPrompt.tsx": "Implements a PWA installation prompt supporting both standard and iOS flows, with dismissal persistence and install handling.",
  "frontend/src/components/LessonPlansTab.tsx": "Provides UI and logic for listing lessons and creating new ones via custom input, uploads, library selection, or AI draft generation.",
  "frontend/src/components/OfflineIndicator.tsx": "Shows temporary online/offline alerts based on PWA connectivity state.",
  "frontend/src/components/OnboardingGuide.tsx": "Implements a multi‑step onboarding dialog with stored completion state and feature explanations.",
  "frontend/src/components/PremiumBanner.tsx": "Displays a premium upsell alert when the user lacks premium access, offering an upgrade button.",
  "frontend/src/components/ProfileSetup.tsx": "Handles initial profile creation with name and role selection, auto‑locking role based on sign‑in type.",
  "frontend/src/components/ProgressTab.tsx": "Displays assignment statistics and progress visuals for a student, including completion and grade metrics.",
  "frontend/src/components/QueryErrorState.tsx": "Renders a standardized error alert with optional retry action for failed data loads.",
  "frontend/src/components/ReportCardsTab.tsx": "Manages viewing, generating, and upgrading access for student report cards, including subscription handling.",
  "frontend/src/components/RoleSignInButtons.tsx": "Provides role-based login buttons for educator/parent and student, supporting compact dropdown and full-size variants.",
  "frontend/src/components/ServiceWorkerUpdatePrompt.tsx": "Displays a prompt when a service worker update is available and handles refreshing or dismissing the update.",
  "frontend/src/components/StripeSetup.tsx": "Modal form allowing admins to configure Stripe secret key and allowed countries, saving via mutation.",
  "frontend/src/constants/branding.ts": "Defines app branding constants including name and tagline.",
  "frontend/src/constants/premiumPricing.ts": "Defines premium report card pricing constants and a helper to build checkout items.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and refreshes dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity authentication, managing identity loading, login, and state.",
  "frontend/src/hooks/usePWA.ts": "Tracks PWA installation, online status, and service worker update availability with periodic update checks.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend operations including publication, user profiles, and other domain actions.",
  "frontend/src/index.css": "Tailwind setup defining light/dark CSS variables, base element styling, and scroll utility classes.",
  "frontend/src/main.tsx": "Initializes React app with React Query and Internet Identity provider before rendering App.",
  "frontend/src/pages/AppStorePreview.tsx": "Empty placeholder page component.",
  "frontend/src/pages/Dashboard.tsx": "Dashboard UI with tabbed navigation, onboarding logic, and role‑based content for lessons, assignments, progress, and reports.",
  "frontend/src/pages/LandingPage.tsx": "Landing page that loads App Store preview data, handles loading/errors, and displays hero and features sections with sign‑in options.",
  "frontend/src/pages/PaymentCancel.tsx": "Displays a cancellation notice after failed payment and provides navigation back to the dashboard.",
  "frontend/src/pages/PaymentSuccess.tsx": "Shows a success message for completed payments, invalidates premium access cache, and links back to the dashboard.",
  "frontend/src/pages/Takedown.tsx": "Maintenance/takedown screen with optional reason and admin publication controls.",
  "frontend/src/utils/authorizationErrors.ts": "Classifies authorization errors and returns standardized user‑friendly messages.",
  "frontend/src/utils/clearAppData.ts": "Clears stored app state from localStorage and sessionStorage with fallback handling.",
  "frontend/src/utils/lessonUpload.ts": "Utilities for validating, titling, and reading uploaded text lesson files and generating error messages.",
  "frontend/src/utils/signInType.ts": "Stores and retrieves pre‑login sign‑in type in sessionStorage for identity workflows.",
  "frontend/src/utils/urlParams.ts": "Helpers for reading URL and hash parameters, persisting them in sessionStorage, and removing parameters from the hash.",
  "frontend/src/utils/userFacingErrors.ts": "Maps technical error messages to simplified user-friendly text with special handling for network, authentication, and trap errors.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending colors, animations, and layout settings with plugins for typography, container queries, and animations.",
  "project_state.json": "Project metadata describing current version, issues, architectural notes, and existing feature requirements for the app."
}