{
  "backend/main.mo": "Motoko backend actor defining publication status controls, user roles, lesson/assignment/report-card types, and admin-gated publish/unpublish functions with runtime traps for unauthorized access.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test IDs with high-confidence metadata.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend file’s purpose, focusing on routing, role-gating, React Query hooks, UI components, and premium/report-card logic.",
  "frontend/index.css": "Tailwind base/style variables defining light/dark color schemes, global background/foreground styles, and shared border/input/ring tokens.",
  "frontend/index.html": "HTML entry page defining metadata, PWA manifest links, Apple touch settings, and script bootstrapping for the React app.",
  "frontend/public/manifest.json": "PWA manifest specifying app name, icons, display mode, theme colors, categories, and start URL for Homeschool Hub K-12.",
  "frontend/public/service-worker.js": "Service worker implementing static and dynamic caching, network-first rules for backend API calls, offline fallback, and cache cleanup logic.",
  "frontend/src/App.tsx": "Main React app wiring router, query client, theme provider, and index route logic for identity handling, publication checks, profile setup, and dashboard rendering.",
  "frontend/src/components/AdminPublicationControls.tsx": "Renders admin-only controls to publish or unpublish the app, including a reason form and loading states. Uses query hooks to manage publication status mutations.",
  "frontend/src/components/AssignmentsTab.tsx": "Displays student assignments and provides dialogs for submitting, grading, and creating assignments. Integrates lesson selection, validation, and mutation hooks for assignment actions.",
  "frontend/src/components/Footer.tsx": "Simple footer showing copyright info and a link to caffeine.ai. Includes a heart icon for branding.",
  "frontend/src/components/Header.tsx": "Top navigation bar with app branding, theme toggle, login/logout actions, and offline indicator. Uses Internet Identity and React Query cleanup on logout.",
  "frontend/src/components/InstallPrompt.tsx": "Handles PWA install prompts with iOS-specific guidance and dismissal persistence. Shows a card prompting users to install the app when eligible.",
  "frontend/src/components/LessonPlansTab.tsx": "Provides UI for listing, creating, uploading, or AI‑generating lesson plans. Supports subject selection, library imports, file parsing, and saving via mutation hooks.",
  "frontend/src/components/OfflineIndicator.tsx": "Shows temporary alerts when the user goes offline or comes back online. Listens to PWA connectivity state and animates indicators accordingly.",
  "frontend/src/components/OnboardingGuide.tsx": "Implements a multi-step onboarding dialog with localStorage tracking and feature/subject previews including premium upsell content.",
  "frontend/src/components/PremiumBanner.tsx": "Displays a premium upsell alert when the user lacks premium access and triggers the upgrade flow.",
  "frontend/src/components/ProfileSetup.tsx": "Provides a profile creation form with name and role selection, auto-locking role based on sign-in type.",
  "frontend/src/components/ProgressTab.tsx": "Shows assignment completion, overall grade averages, and summary stats for a student's progress.",
  "frontend/src/components/ReportCardsTab.tsx": "Handles premium status, report card generation, Stripe checkout, and subscription management UI.",
  "frontend/src/components/RoleSignInButtons.tsx": "Renders educator/parent and student sign-in buttons, storing sign-in type before triggering Internet Identity login.",
  "frontend/src/components/StripeSetup.tsx": "Modal form for configuring Stripe secret key and allowed countries, submitting via useSetStripeConfiguration.",
  "frontend/src/constants/branding.ts": "Defines the app name, short name, and tagline used for branding.",
  "frontend/src/constants/premiumPricing.ts": "Defines premium report card pricing constants and provides a helper to generate checkout items.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refreshing queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity login, identity loading, and state management.",
  "frontend/src/hooks/usePWA.ts": "Tracks PWA install state, network status, and service worker update availability.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for backend operations like profiles, publication status, and admin actions.",
  "frontend/src/index.css": "Tailwind base and custom CSS variables for theming, dark mode, and scrolling utilities.",
  "frontend/src/main.tsx": "Application entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/AppStorePreview.tsx": "Empty file with no implementation.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard with tabs for lessons, assignments, progress, and reports, plus onboarding and premium features.",
  "frontend/src/pages/LandingPage.tsx": "Displays the marketing landing page with dynamic preview content, sign‑in options, and feature highlights.",
  "frontend/src/pages/PaymentCancel.tsx": "Shows a cancellation message after a failed payment and provides navigation back to the dashboard.",
  "frontend/src/pages/PaymentSuccess.tsx": "Shows a success message after payment, refreshes premium access, and links back to the dashboard.",
  "frontend/src/pages/Takedown.tsx": "Displays a maintenance/unavailable notice with optional reason and admin publication controls.",
  "frontend/src/utils/authorizationErrors.ts": "Detects authorization errors and returns standardized user‑friendly messages.",
  "frontend/src/utils/lessonUpload.ts": "Provides helpers for validating lesson file types, generating titles, reading text files, and formatting upload errors.",
  "frontend/src/utils/signInType.ts": "Stores and retrieves the user’s pre‑login sign‑in type in sessionStorage.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters using query strings, hashes, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind config defining content paths, theme extensions (colors, radius, animations), and plugins for typography, container queries, and animation.",
  "project_state.json": "Project metadata describing current version, architectural notes, known issues, and a list of existing feature requirements for role-specific sign-in and maintenance-mode behavior."
}