{
  "backend/main.mo": "Motoko backend actor defining publication status controls, access checks, user roles, and extensive type definitions for profiles, lessons, assignments, and report cards.",
  "feature_evidence.json": "Feature evidence report listing premium pricing–related frontend files, components, and test IDs for Stripe checkout behavior and UI price formatting.",
  "frontend-file-summaries.txt": "Prewritten summaries outlining the purpose of each frontend file, including routing, UI components, premium features, and backend communication hooks.",
  "frontend/index.css": "Tailwind base stylesheet defining theme variables, light/dark modes, and global styling rules.",
  "frontend/index.html": "Base HTML document configuring PWA metadata, Apple touch icons, splash settings, and the root mount point.",
  "frontend/public/manifest.json": "PWA manifest describing app metadata, icons, categories, and display settings for Homeschool Hub K‑12.",
  "frontend/public/service-worker.js": "Service worker handling install, activate, cache management, offline behavior, and fetch strategies for static and dynamic assets.",
  "frontend/src/App.tsx": "Top-level React app configuring routing, theme, query client, authentication flow, publication checks, and conditional rendering for dashboard, setup, and landing screens.",
  "frontend/src/components/AdminPublicationControls.tsx": "Admin UI for publishing or unpublishing the app with status display and reason input.",
  "frontend/src/components/AssignmentsTab.tsx": "Displays student assignments and provides teachers options to assign lessons, grade, and manage submissions.",
  "frontend/src/components/Footer.tsx": "Simple footer showing copyright and a link to caffeine.ai.",
  "frontend/src/components/Header.tsx": "Top navigation bar with theme toggle, authentication controls, and offline indicator.",
  "frontend/src/components/InstallPrompt.tsx": "Manages PWA installation prompts for web and iOS, including dismissal and standalone checks.",
  "frontend/src/components/LessonPlansTab.tsx": "Lists and filters lesson plans and allows teachers to create new lesson plans from scratch or library.",
  "frontend/src/components/OfflineIndicator.tsx": "Shows temporary online/offline status alerts based on PWA connectivity.",
  "frontend/src/components/OnboardingGuide.tsx": "Multi-step onboarding modal guiding teachers or students, with localStorage tracking and dynamic step content.",
  "frontend/src/components/PremiumBanner.tsx": "Shows a premium upsell alert when the user lacks premium access, with an upgrade button.",
  "frontend/src/components/ProfileSetup.tsx": "Profile creation form that sets name and role, with role defaults based on sign‑in type and save mutation.",
  "frontend/src/components/ProgressTab.tsx": "Displays assignment completion stats and grade averages for a student using fetched assignment data.",
  "frontend/src/components/ReportCardsTab.tsx": "Manages report card display and generation, premium access checks, Stripe checkout, and subscription cancellation.",
  "frontend/src/components/RoleSignInButtons.tsx": "Provides educator/parent or student sign‑in options, storing selected role and triggering II login.",
  "frontend/src/components/StripeSetup.tsx": "Modal form for entering Stripe secret key and allowed countries, submitting configuration via mutation.",
  "frontend/src/constants/branding.ts": "Exports app name, short name, and tagline for centralized branding.",
  "frontend/src/constants/premiumPricing.ts": "Defines constants for premium report card pricing and provides a helper to generate checkout items.",
  "frontend/src/hooks/useActor.ts": "Builds and manages the authenticated or anonymous backend actor and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, logout, and stored identity restoration.",
  "frontend/src/hooks/usePWA.ts": "Tracks PWA install status, online/offline state, and detects service worker updates.",
  "frontend/src/hooks/useQueries.ts": "Collection of react-query hooks for fetching and mutating backend data such as profiles, subjects, roles, and app publication.",
  "frontend/src/index.css": "Tailwind base setup defining theme variables, dark mode values, and utility classes for scrolling.",
  "frontend/src/main.tsx": "Entry point that initializes React, wraps the app with react-query and Internet Identity providers.",
  "frontend/src/pages/AppStorePreview.tsx": "Empty file placeholder for the App Store preview page.",
  "frontend/src/pages/Dashboard.tsx": "Renders the main dashboard with tabs for lessons, assignments, progress, and report cards, including onboarding and premium banner logic.",
  "frontend/src/pages/LandingPage.tsx": "Displays the marketing landing page with hero content, features, and sign-in options based on authentication state.",
  "frontend/src/pages/PaymentCancel.tsx": "Shows a cancellation message when a payment fails and provides navigation back to the dashboard.",
  "frontend/src/pages/PaymentSuccess.tsx": "Confirms successful payment, refreshes premium access state, and links users back to the dashboard.",
  "frontend/src/pages/Takedown.tsx": "Presents a maintenance or takedown notice with optional reason details and admin controls.",
  "frontend/src/utils/signInType.ts": "Manages storing, retrieving, and clearing the user's sign‑in type in sessionStorage.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, persisting, and clearing URL parameters across navigation, including hash‑based routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins for the frontend styling system.",
  "project_state.json": "Defines overall project state, architecture notes, and a list of existing features for role-specific sign-in, maintenance mode, and publishing controls. Captures versioning, known issues, and requirements metadata."
}