{
  "kind": "build_request",
  "title": "Fine-tune role-based access control UX and authorization messaging (Version 26)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-28",
      "text": "Audit and fine-tune frontend role-gating so Educator/Parent-only controls never appear for Student users, including during initial loading states and after identity/profile changes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "should fine tune it"
        ]
      },
      "acceptanceCriteria": [
        "When signed in as a Student (user role), the Lesson Plans UI does not show the “Create Lesson Plan” button and does not show the “AI Create” tab at any point (including during initial profile fetch/loading).",
        "When signed in as an Educator/Parent (admin role), Lesson Plans creation controls (Custom, Upload, Library, AI Create) remain available as expected.",
        "After logout/login switching between Student and Educator/Parent, the gated controls update correctly without requiring a hard refresh.",
        "Dashboard prop naming and UI copy do not refer to “teacher” in user-facing labels when the intended role is Educator/Parent (admin)."
      ]
    },
    {
      "id": "REQ-29",
      "text": "Standardize and improve user-facing authorization error handling for access-controlled actions (lesson creation, library add, AI draft generation, assignments, premium actions) so the app shows clear English messages instead of raw trap strings.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "should fine tune it"
        ]
      },
      "acceptanceCriteria": [
        "If the backend rejects an action due to missing permissions, the UI shows a consistent, clear toast message in English (e.g., “This action is only available to Educators/Parents.”) rather than surfacing raw backend error text.",
        "Non-authorization errors (e.g., network issues, validation errors) still show a useful failure message that includes the underlying error message.",
        "Existing React Query hooks in frontend/src/hooks/useQueries.ts follow the same authorization-detection pattern for all relevant mutations and queries (no inconsistent wording like “teachers only” for Educator/Parent flows)."
      ]
    },
    {
      "id": "REQ-30",
      "text": "Fine-tune backend authorization trap messages for access-controlled endpoints so they are consistent, role-accurate, and easy for the frontend to classify as authorization failures.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "should fine tune it"
        ]
      },
      "acceptanceCriteria": [
        "All backend Runtime.trap authorization failures for role/permission checks use consistent English phrasing that clearly indicates an authorization failure and the intended allowed role (e.g., Educators/Parents for admin-only actions).",
        "Student-facing authorization failures do not mention “teachers” if the allowed role is Educator/Parent (admin).",
        "No state schema migration is introduced unless strictly required for this change."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo; do not introduce additional backend services.",
    "Do not edit any files under frontend/src/components/ui or any other paths listed as immutable in SYSTEM_CONTEXT.",
    "Use English for all user-facing UI text and toast messages.",
    "Do not add third-party authentication providers; continue using Internet Identity."
  ],
  "nonGoals": [
    "Adding new roles beyond the existing admin/user model.",
    "Changing the published/unpublished (maintenance mode) feature behavior.",
    "Introducing real-time communication features (WebSockets, chat, push notifications)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}