{
  "kind": "build_request",
  "title": "Publish Version 30 by setting app publication status to published",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-39",
      "text": "Publish the currently deployed Version 30 build by setting the backend publication status to \"published\" using the existing admin-only publish mechanism (backend method: publishApp), so regular users can access the Landing Page / Profile Setup / Dashboard instead of the takedown screen.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "yes publish"
        ]
      },
      "acceptanceCriteria": [
        "When an admin triggers the existing publish action, the backend publication status becomes \"published\" (PublicationStatus.#published).",
        "Visiting '/' as an unauthenticated user shows the Landing Page (not the Takedown screen).",
        "Visiting '/' as an authenticated user reaches Profile Setup (if no profile exists) or Dashboard (if a profile exists), without being blocked by unpublished/maintenance gating.",
        "Non-admin users cannot publish (attempts are rejected with an English authorization error and the UI does not expose admin publication controls to non-admins)."
      ]
    }
  ],
  "constraints": [
    "Respect the existing single-actor Motoko backend architecture; do not introduce additional canisters/services.",
    "Do not edit files under frontend/src/components/ui or any other frontend immutable paths listed in SYSTEM_CONTEXT; compose existing UI components instead."
  ],
  "nonGoals": [
    "Do not change any other app behavior or features beyond publishing (no additional UI/UX changes, pricing changes, or role-gating changes).",
    "Do not add new authentication providers; continue using Internet Identity only."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}