{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "RBAC UX gating + consistent authorization messaging (V26)",
  "requirements": [
    {
      "id": "REQ-28",
      "summary": "Eliminate Student-visible flashes of Educator/Parent-only controls and remove “teacher” wording from role-related props/copy.",
      "acceptanceCriteria": [
        "When signed in as a Student (user role), the Lesson Plans UI does not show the “Create Lesson Plan” button and does not show the “AI Create” tab at any point (including during initial profile fetch/loading).",
        "When signed in as an Educator/Parent (admin role), Lesson Plans creation controls (Custom, Upload, Library, AI Create) remain available as expected.",
        "After logout/login switching between Student and Educator/Parent, the gated controls update correctly without requiring a hard refresh.",
        "Dashboard prop naming and UI copy do not refer to “teacher” in user-facing labels when the intended role is Educator/Parent (admin)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Harden role-dependent caching by scoping current-user queries (e.g., currentUserProfile/currentUserRole/isCallerAdmin) to the active identity/principal in their React Query keys, and ensure they do not temporarily reuse prior-user data during identity/profile changes. Use the authorization component’s frontend guidance around clearing cached app data on logout; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Rename internal role booleans/props away from “teacher” (e.g., use isEducatorParent / isAdmin) and pass correctly named props to tabs. Ensure the welcome subtext and any other user-facing copy consistently refers to “Educators/Parents” (not “teachers”)."
        },
        {
          "path": "frontend/src/components/LessonPlansTab.tsx",
          "operation": "modify",
          "description": "Rename LessonPlansTab prop from isTeacher to a role-accurate name (e.g., isEducatorParent) and ensure all educator-only controls (Create Lesson Plan button + AI Create tab + any creation dialog content) are strictly gated by that prop with no intermediate render states that could show them to Students."
        },
        {
          "path": "frontend/src/components/AssignmentsTab.tsx",
          "operation": "modify",
          "description": "Rename isTeacher prop to a role-accurate name (Educator/Parent) and ensure educator-only actions (Assign Lesson, Grade Assignment) are gated consistently, including during any initial data-loading states."
        },
        {
          "path": "frontend/src/components/OnboardingGuide.tsx",
          "operation": "modify",
          "description": "Update prop naming and user-facing onboarding copy so it reflects “Educator/Parent” vs “Student” roles (avoid “teacher” wording). Ensure onboarding steps shown are aligned with role-gated capabilities."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Confirm app-level loading guards prevent rendering role-gated screens until the authenticated user profile state is resolved for the current identity, and adjust if needed so role-gated controls cannot appear during initial fetch/loading or immediately after identity switches."
        }
      ]
    },
    {
      "id": "REQ-29",
      "summary": "Standardize authorization failure detection and user-facing messaging across all access-controlled actions and hooks.",
      "acceptanceCriteria": [
        "If the backend rejects an action due to missing permissions, the UI shows a consistent, clear toast message in English (e.g., “This action is only available to Educators/Parents.”) rather than surfacing raw backend error text.",
        "Non-authorization errors (e.g., network issues, validation errors) still show a useful failure message that includes the underlying error message.",
        "Existing React Query hooks in frontend/src/hooks/useQueries.ts follow the same authorization-detection pattern for all relevant mutations and queries (no inconsistent wording like “teachers only” for Educator/Parent flows)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/authorizationErrors.ts",
          "operation": "create",
          "description": "Add a small shared helper to classify authorization failures from backend trap/error strings (e.g., detect “Unauthorized:” and other known role/permission phrases) and to produce standardized, role-accurate English UI messages (Educator/Parent vs Student) while preserving underlying error text for non-authorization failures. Use the authorization component’s error-handling guidance; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Adopt the shared authorization error classifier for all relevant access-controlled mutations and queries (lesson creation, library add, AI draft generation, assignments actions, publishing/admin actions, premium/Stripe admin actions). Replace ad-hoc string checks and inconsistent wording (including any “teachers only”) with consistent messaging like “This action is only available to Educators/Parents.” For non-authorization failures, keep a helpful message that includes the original error message. Verify the authorization component’s usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/LessonPlansTab.tsx",
          "operation": "modify",
          "description": "Ensure any toasts or inline error handling triggered by lesson creation flows align with the standardized authorization messaging (no raw trap text, no “teachers only”)."
        },
        {
          "path": "frontend/src/components/AssignmentsTab.tsx",
          "operation": "modify",
          "description": "Ensure assignment-related actions that can be rejected for permissions (assigning lessons, grading) show standardized authorization toasts instead of raw trap strings, while keeping non-authorization errors informative."
        },
        {
          "path": "frontend/src/components/ReportCardsTab.tsx",
          "operation": "modify",
          "description": "Align premium-related actions that can be access-controlled (e.g., premium grant/cancel, configuration-related actions surfaced in UI) with standardized authorization error messaging rather than raw backend error text."
        }
      ]
    }
  ]
}