{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Update premium pricing cadence copy and checkout metadata to 9 weeks",
  "requirements": [
    {
      "id": "REQ-13",
      "summary": "Replace all user-facing premium pricing cadence copy to $5 billed every 9 weeks (remove any '3 months' mentions).",
      "acceptanceCriteria": [
        "The premium upsell banner copy says \"$5 every 9 weeks\" (and does not mention \"3 months\").",
        "The Report Cards upgrade screen shows \"$5 / 9 weeks\" (or equivalent clear English) instead of \"$5 / 3 months\".",
        "No other frontend screens mention the old premium billing cadence (\"3 months\")."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PremiumBanner.tsx",
          "operation": "modify",
          "description": "Update the premium upsell banner copy to say \"$5 every 9 weeks\" and remove any \"3 months\"/\"every 3 months\" messaging. Uses shadcn-ui Alert/Button components already composed in this file (do not edit files under frontend/src/components/ui). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/ReportCardsTab.tsx",
          "operation": "modify",
          "description": "Update the Report Cards upgrade screen pricing display text from \"$5 / 3 months\" to \"$5 / 9 weeks\" (or equivalent clear English), ensuring no user-facing copy in this screen mentions \"3 months\". Uses shadcn-ui Card/Button/Badge/etc already composed in this file (do not edit files under frontend/src/components/ui). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/OnboardingGuide.tsx",
          "operation": "modify",
          "description": "Update onboarding Premium Report Cards step copy to reference \"$5 every 9 weeks\" and remove the \"every 3 months\" phrasing so onboarding no longer mentions the old cadence. Uses shadcn-ui Dialog/Progress/ScrollArea composed in this file (do not edit files under frontend/src/components/ui). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-14",
      "summary": "Update Stripe checkout line-item description metadata to reflect 9 weeks of premium access while keeping the $5 (500 cents) amount.",
      "acceptanceCriteria": [
        "When starting checkout, the item description reflects “9 weeks” rather than “3 months”.",
        "The checkout amount remains $5 (500 cents)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ReportCardsTab.tsx",
          "operation": "modify",
          "description": "In the checkout items passed to the createCheckoutSession mutation, update the ShoppingItem.productDescription from \"3 months access to report card features\" to \"9 weeks access to report card features\" (or equivalent), and confirm priceInCents stays BigInt(500) with quantity unchanged. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}