{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Enable admin publish flow to remove takedown gating",
  "requirements": [
    {
      "id": "REQ-39",
      "summary": "Ensure the existing admin-only publish action updates client publication gating so the app shows Landing/Profile Setup/Dashboard when published, while keeping publish controls hidden for non-admins and showing English authorization errors when rejected.",
      "acceptanceCriteria": [
        "When an admin triggers the existing publish action, the backend publication status becomes \"published\" (PublicationStatus.#published).",
        "Visiting '/' as an unauthenticated user shows the Landing Page (not the Takedown screen).",
        "Visiting '/' as an authenticated user reaches Profile Setup (if no profile exists) or Dashboard (if a profile exists), without being blocked by unpublished/maintenance gating.",
        "Non-admin users cannot publish (attempts are rejected with an English authorization error and the UI does not expose admin publication controls to non-admins)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Harden the existing publish/unpublish React Query mutations so they reliably refresh the cached publication status used by route gating (invalidate + refetch remains), and ensure authorization failures produce a correct English toast message by passing the classified authorization message text (not an object) into the user-facing error normalizer. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/authorizationErrors.ts",
          "operation": "modify",
          "description": "Update authorization error classification to explicitly recognize admin-only publish/unpublish rejections (e.g., messages containing \"only admins\" / \"admin\" / \"Unauthorized\") and return a clear English message appropriate for non-admin publish attempts (admin-only). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AdminPublicationControls.tsx",
          "operation": "modify",
          "description": "Keep the publication controls admin-only (continue to render nothing for non-admins), and ensure the publish action uses the existing publish mechanism hook while relying on shared error handling (toast) rather than only console logging, so non-admin attempts (if any) surface an English authorization error. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Confirm the index route publication gating cleanly switches between Takedown and normal app flows based on PublicationStatus (published vs unpublished) and responds immediately after publication status refetch (post-publish) without requiring a manual reload. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}