{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Educator/Parent lesson plan creation parity + upload flow",
  "requirements": [
    {
      "id": "REQ-23",
      "summary": "Ensure Educator/Parent (admin) users can access full lesson plan creation UI while Students cannot see creation controls.",
      "acceptanceCriteria": [
        "When the signed-in user has role=admin (Educator/Parent), the Lesson Plans tab shows the “Create Lesson Plan” button and the full creation dialog (Custom, AI, Library).",
        "When the signed-in user has role=user (Student), the Lesson Plans tab does not show the “Create Lesson Plan” button or any creation/upload controls.",
        "All user-facing text remains in English and is consistent with the Educator/Parent vs Student sign-in model already present in the app."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Dashboard.tsx",
          "operation": "modify",
          "description": "Align the lesson-plan creation permission flag with the app’s role model (admin=Educator/Parent, user=Student) and pass a clearly named prop to the LessonPlans tab so Students never receive creation-enabled UI."
        },
        {
          "path": "frontend/src/components/LessonPlansTab.tsx",
          "operation": "modify",
          "description": "Update the Lesson Plans UI gating to use the admin/Educator-Parent permission prop consistently (including the Create button and the creation dialog/tabs) and ensure labels remain English and consistent with the Educator/Parent vs Student model."
        }
      ]
    },
    {
      "id": "REQ-24",
      "summary": "Add an Upload Lesson option to the Create New Lesson Plan dialog that reads local text files client-side and saves via the existing lesson creation flow.",
      "acceptanceCriteria": [
        "The creation dialog includes a clearly labeled upload option (e.g., a 4th tab) for Educator/Parent users.",
        "The upload flow requires the user to choose Subject and Grade Level (same as other creation paths).",
        "The upload flow allows selecting a local file of a supported text-based format (at minimum: .txt and .md) and shows a clear validation error if the file type is unsupported.",
        "On upload, the app reads the file content in the browser and uses it as the lesson content for saving.",
        "The lesson title defaults to a sensible value (e.g., derived from filename) but remains editable before saving.",
        "Clicking “Save” creates the lesson plan via the existing lesson creation mutation and the new lesson appears in the lesson plan list after success.",
        "No uploaded file bytes are stored on the backend; only the extracted text content is saved as the lesson plan content."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/lessonUpload.ts",
          "operation": "create",
          "description": "Add small client-side helpers for validating supported text-based lesson file types (.txt, .md), deriving a default title from a filename, and reading file contents as text for the upload-to-lesson flow."
        },
        {
          "path": "frontend/src/components/LessonPlansTab.tsx",
          "operation": "modify",
          "description": "Extend the Create New Lesson Plan dialog to include a 4th tab (e.g., “Upload Lesson”), implement the upload form (Subject + Grade Level + editable Title + file picker), validate .txt/.md, read file contents in-browser, and call the existing create custom lesson mutation to save."
        }
      ]
    },
    {
      "id": "REQ-25",
      "summary": "Ensure AI draft generation + saving works for Educator/Parent users and improve user-facing authorization error messaging for lesson plan creation actions.",
      "acceptanceCriteria": [
        "An Educator/Parent user can generate an AI draft, edit it, and save it as a lesson plan successfully.",
        "If a Student attempts to invoke lesson plan creation actions (e.g., by manipulating the UI), the app shows a clear English error message indicating they are not allowed to perform that action.",
        "Any backend trap/error strings that are surfaced to end users for lesson-plan creation do not misleadingly say “teachers only” when the permission is actually tied to the Educator/Parent (admin) role."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Normalize authorization-related errors surfaced via toast for lesson plan creation flows (create custom lesson, create from library, AI draft generation) so messages clearly state Educator/Parent (admin) is allowed and Students are not; avoid “teachers only” phrasing. Use the existing authorization component patterns for handling backend trap errors gracefully. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/LessonPlansTab.tsx",
          "operation": "modify",
          "description": "Add lightweight UI-side guards where appropriate (e.g., disable/hide save actions when creation is not permitted) and ensure any surfaced errors are clear English and role-accurate (Educator/Parent vs Student), especially around AI draft generation and saving."
        }
      ]
    }
  ]
}