{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Premium Report Card Stripe price to $5.00 (500 cents) and align UI price display",
  "requirements": [
    {
      "id": "REQ-17",
      "summary": "Send a fixed $5.00 (500 cents) line item when starting the Premium Report Card Stripe checkout flow from the frontend.",
      "acceptanceCriteria": [
        "When starting the Premium upgrade flow, the checkout session request includes a single line item with priceInCents = 500 (USD) and quantity = 1.",
        "No frontend code path sends a different priceInCents value for Premium Report Card Access."
      ],
      "file_operations": [
        {
          "path": "frontend/src/constants/premiumPricing.ts",
          "operation": "create",
          "description": "Create a single source of truth for Premium Report Card pricing (e.g., PREMIUM_PRICE_CENTS = 500n, PREMIUM_CURRENCY = 'usd', PREMIUM_PRODUCT_NAME, PREMIUM_QUANTITY = 1n) and a helper to build the Stripe ShoppingItem array for checkout so no other code path can diverge."
        },
        {
          "path": "frontend/src/components/ReportCardsTab.tsx",
          "operation": "modify",
          "description": "Update the Premium upgrade flow to build checkout items exclusively from the shared premium pricing constants/helper so the request always sends exactly one line item with priceInCents=500 (USD) and quantity=1; continue redirecting via window.location.href. Use the existing Stripe checkout mutation (useCreateCheckoutSession) consistent with the selected \"stripe\" component. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-19",
      "summary": "Update all Premium Report Card price UI text to display “$5.00” (two decimals) wherever shown.",
      "acceptanceCriteria": [
        "Premium pricing UI text displays “$5.00” (not “$5”) wherever the premium price is shown.",
        "All updated user-facing text remains in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ReportCardsTab.tsx",
          "operation": "modify",
          "description": "Update the Premium upsell price display to show “$5.00” (two decimal places) and, where appropriate, use the shared display-price constant from frontend/src/constants/premiumPricing.ts to avoid drift."
        },
        {
          "path": "frontend/src/components/PremiumBanner.tsx",
          "operation": "modify",
          "description": "Update the banner copy to display “$5.00” (two decimal places) and optionally reference the shared display-price constant from frontend/src/constants/premiumPricing.ts so the banner stays consistent with the checkout price."
        },
        {
          "path": "frontend/src/components/OnboardingGuide.tsx",
          "operation": "modify",
          "description": "Update the Premium onboarding step description text to display “$5.00” (two decimal places) and keep all user-facing text in English."
        }
      ]
    }
  ]
}