{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-12T06:27:22.671Z",
  "summary": "REQ-39 asks to publish the currently deployed Version 30 by setting backend publication status to `PublicationStatus.#published` via the existing admin-only `publishApp` mechanism so users no longer see the takedown gate. The diff shows frontend work around querying publication status and adding/adjusting admin publication UI/hooks, but does not show any backend/state change that actually sets the deployed app’s publication status to published.",
  "missing_requirements": [
    {
      "id": "REQ-39",
      "requirement": "Publish the currently deployed Version 30 build by setting the backend publication status to \"published\" (PublicationStatus.#published) using the existing admin-only publish mechanism (publishApp), so normal users are not blocked by the takedown/unpublished gate.",
      "reason": "The diff only shows frontend changes (queries/UI) and does not include any backend/state/config change that would set the already-deployed app’s publication status to `#published`. Without an explicit state change in the deployed backend, the app may remain unpublished and continue showing the takedown gate.",
      "evidence": [
        "frontend/src/hooks/useQueries.ts",
        "frontend/src/App.tsx",
        "frontend/src/components/AdminPublicationControls.tsx"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Added/expanded admin UI to *unpublish* the app with an unpublish-reason form (in addition to publishing).",
      "reason": "REQ-39 only requests publishing Version 30 to `published` using the existing publish mechanism; it does not request adding/changing unpublish controls or UX.",
      "evidence": [
        "frontend/src/components/AdminPublicationControls.tsx",
        "frontend/src/hooks/useQueries.ts"
      ]
    },
    {
      "description": "Introduced/expanded generalized authorization error classification messaging (including Educator/Parent role messaging).",
      "reason": "REQ-39’s auth requirement is limited to non-admin publish attempts being rejected with an English authorization error and no non-admin publish UI exposure. Broad role-based authorization messaging changes are outside the publishing-only scope.",
      "evidence": [
        "frontend/src/utils/authorizationErrors.ts",
        "frontend/src/hooks/useQueries.ts"
      ]
    }
  ],
  "confidence": 0.55,
  "changed_files": [
    "frontend-file-summaries.txt",
    "frontend/src/App.tsx",
    "frontend/src/components/AdminPublicationControls.tsx",
    "frontend/src/hooks/useQueries.ts",
    "frontend/src/utils/authorizationErrors.ts",
    "project_state.json"
  ]
}